AEyeSecurity/ESP32_SALUS/src/pi_comms.cpp
#include "pi_comms.h"

#include <array>
#include <cstring>
#include <limits>

#include <math.h>

#include "esp_err.h"
#include "esp_timer.h"
#include "esp32-hal-timer.h"

#include "hall_speed.h"
#include "ota_telnet.h"
#include "pid.h"
#include "quad_functions.h"
#include "battery_monitor.h"
#include "steering_calibration.h"
#include "system_diag.h"

namespace {

constexpr uint8_t kHeaderRx = 0xAA;
constexpr uint8_t kHeaderTx = 0x55;
constexpr uint8_t kHeaderBatteryTx = 0x56;
constexpr size_t kRxFrameSize = 7;
constexpr size_t kTxFrameSize = 8;
constexpr size_t kBatteryTxFrameSize = 8;
constexpr uint8_t kProtocolVersion = 2;
constexpr uint32_t kPiRxWakeTimeoutFactor = 4;
constexpr uint8_t kPiRxWakeTimerIndex = 0;
constexpr uint16_t kPiRxWakeTimerDivider = 80;  // 1 tick = 1 us (80 MHz / 80)
constexpr size_t kPiRxReadChunkSize = 24;       // Bound RX parse work per 2ms cycle
constexpr uint32_t kBatteryFreshFactor = 2;
constexpr uint16_t kBatterySuspectAdcThresholdMv = 3200;

PiCommsConfig g_config{};
bool g_initialized = false;

struct PiRxState {
  bool hasFrame = false;
  TickType_t lastFrameTick = 0;
  uint8_t verFlags = 0;
  int8_t steer = 0;
  uint16_t speedCmdCentiMps = 0;
  int16_t speedCmdSignedCentiMps = 0;
  bool speedReverseRequest = false;
  bool hazardLightRequested = false;
  bool driveEnabled = false;
  bool estop = false;
  uint8_t brake = 0;
  uint32_t framesOk = 0;
  uint32_t framesCrcError = 0;
  uint32_t framesMalformed = 0;
  uint32_t framesVersionError = 0;
};

PiRxState g_rxState{};

struct PiBatteryTxState {
  bool hasFrame = false;
  TickType_t lastFrameTick = 0;
  uint8_t flags = 0;
  uint16_t batteryCentiVolts = 0;
  uint16_t adcPinMv = 0;
  uint8_t sampleAgeDs = 0;
  uint32_t framesSent = 0;
};

PiBatteryTxState g_batteryTxState{};
bool g_hallTelemetryTraceEnabled = false;

portMUX_TYPE g_stateMux = portMUX_INITIALIZER_UNLOCKED;
portMUX_TYPE g_piRxWakeMux = portMUX_INITIALIZER_UNLOCKED;
TaskHandle_t g_piRxWakeTaskHandle = nullptr;
hw_timer_t* g_piRxWakeTimer = nullptr;

constexpr uint8_t kCmdFlagEstop = 1 << 0;
constexpr uint8_t kCmdFlagDriveEnable = 1 << 1;
constexpr uint8_t kCmdFlagReverseRequest = 1 << 2;
constexpr uint8_t kCmdFlagHazardLight = 1 << 3;

constexpr uint8_t kStatusReady = 1 << 0;
constexpr uint8_t kStatusEstopActive = 1 << 1;
constexpr uint8_t kStatusFailsafeActive = 1 << 2;
constexpr uint8_t kStatusPiFresh = 1 << 3;
constexpr uint8_t kStatusControlSourceShift = 4;
constexpr uint8_t kStatusControlSourceMask = static_cast<uint8_t>(0x03u << kStatusControlSourceShift);
constexpr uint8_t kStatusOverspeedActive = 1 << 6;

constexpr uint8_t kBatteryStatusReady = 1 << 0;
constexpr uint8_t kBatteryStatusFresh = 1 << 1;
constexpr uint8_t kBatteryStatusSuspect = 1 << 2;
constexpr uint8_t kBatteryStatusCalibrated = 1 << 3;

constexpr uint16_t kSpeedTelemetryNotAvailable = 0xFFFFu;
constexpr int16_t kSteerTelemetryNotAvailable = std::numeric_limits<int16_t>::min();

uint8_t crc8_maxim(const uint8_t* data, size_t len) {
  uint8_t c = 0x00;
  for (size_t i = 0; i < len; ++i) {
    c ^= data[i];
    for (int b = 0; b < 8; ++b) {
      if (c & 0x80) {
        c = static_cast<uint8_t>((c << 1) ^ 0x31);
      } else {
        c <<= 1;
      }
    }
  }
  return c;
}

struct FrameParser {
  size_t index = 0;
  uint8_t buffer[kRxFrameSize]{};

  void reset() { index = 0; }

  bool feed(uint8_t byte, uint8_t (&frame)[kRxFrameSize], bool& malformed) {
    malformed = false;
    if (index == 0) {
      if (byte == kHeaderRx) {
        buffer[0] = byte;
        index = 1;
      }
      return false;
    }

    if (byte == kHeaderRx && index > 0) {
      // Nuevo header inesperado -> descartar trama parcial
      malformed = true;
      buffer[0] = byte;
      index = 1;
      return false;
    }

    buffer[index++] = byte;
    if (index >= kRxFrameSize) {
      std::memcpy(frame, buffer, kRxFrameSize);
      index = 0;
      return true;
    }
    return false;
  }
};

void appendFlag(String& out, bool enabled, const char* label) {
  if (!enabled) {
    return;
  }
  if (out.length() > 0) {
    out += '|';
  }
  out += label;
}

String describeCommandFlags(uint8_t verFlags) {
  String msg;
  msg.reserve(48);
  msg += "ver=";
  msg += (verFlags >> 4) & 0x0F;
  msg += " flags=";
  String flags;
  appendFlag(flags, (verFlags & kCmdFlagEstop) != 0, "ESTOP");
  appendFlag(flags, (verFlags & kCmdFlagDriveEnable) != 0, "DRIVE_EN");
  appendFlag(flags, (verFlags & kCmdFlagReverseRequest) != 0, "REV_REQ");
  appendFlag(flags, (verFlags & kCmdFlagHazardLight) != 0, "HAZARD");
  msg += (flags.length() > 0) ? flags : "none";
  return msg;
}

int16_t clampSignedCentiMps(int32_t value) {
  if (value < static_cast<int32_t>(std::numeric_limits<int16_t>::min())) {
    return std::numeric_limits<int16_t>::min();
  }
  if (value > static_cast<int32_t>(std::numeric_limits<int16_t>::max())) {
    return std::numeric_limits<int16_t>::max();
  }
  return static_cast<int16_t>(value);
}

uint16_t clampToU16(uint32_t value) {
  if (value > static_cast<uint32_t>(std::numeric_limits<uint16_t>::max())) {
    return std::numeric_limits<uint16_t>::max();
  }
  return static_cast<uint16_t>(value);
}

uint8_t clampToU8(uint32_t value) {
  if (value > static_cast<uint32_t>(std::numeric_limits<uint8_t>::max())) {
    return std::numeric_limits<uint8_t>::max();
  }
  return static_cast<uint8_t>(value);
}

const char* statusSourceText(uint8_t sourceCode) {
  switch (sourceCode) {
    case 1:
      return "PI";
    case 2:
      return "RC";
    case 3:
      return "TEL";
    case 0:
    default:
      return "NONE";
  }
}

String describeStatusFlags(uint8_t status) {
  String flags;
  flags.reserve(64);
  appendFlag(flags, (status & kStatusReady) != 0, "READY");
  appendFlag(flags, (status & kStatusEstopActive) != 0, "ESTOP");
  appendFlag(flags, (status & kStatusFailsafeActive) != 0, "FAILSAFE");
  appendFlag(flags, (status & kStatusPiFresh) != 0, "PI_FRESH");
  appendFlag(flags, (status & kStatusOverspeedActive) != 0, "OVERSPEED");

  const uint8_t sourceCode = static_cast<uint8_t>((status & kStatusControlSourceMask) >> kStatusControlSourceShift);

  String msg;
  msg.reserve(96);
  msg += "status=0x";
  msg += String(status, HEX);
  msg += " (";
  msg += (flags.length() > 0) ? flags : "none";
  msg += " src=";
  msg += statusSourceText(sourceCode);
  msg += ")";
  return msg;
}

