AEyeSecurity/ESP32_SALUS/src/pi_comms.cpp
        portENTER_CRITICAL(&g_stateMux);
        g_rxState.hasFrame = newState.hasFrame;
        g_rxState.lastFrameTick = newState.lastFrameTick;
        g_rxState.verFlags = newState.verFlags;
        g_rxState.steer = newState.steer;
        g_rxState.speedCmdCentiMps = newState.speedCmdCentiMps;
        g_rxState.speedCmdSignedCentiMps = newState.speedCmdSignedCentiMps;
        g_rxState.speedReverseRequest = newState.speedReverseRequest;
        g_rxState.hazardLightRequested = newState.hazardLightRequested;
        g_rxState.estop = newState.estop;
        g_rxState.driveEnabled = newState.driveEnabled;
        g_rxState.brake = newState.brake;
        g_rxState.framesOk++;
        newState.framesOk = g_rxState.framesOk;
        newState.framesCrcError = g_rxState.framesCrcError;
        newState.framesMalformed = g_rxState.framesMalformed;
        newState.framesVersionError = g_rxState.framesVersionError;
        portEXIT_CRITICAL(&g_stateMux);

        logRxFrame(*cfg, newState, nowTick);
      }
    }

    const bool overrun = cycleUs > expectedPeriodUs;
    systemDiagReportLoop(SystemDiagTaskId::kPiUartRx, cycleUs, expectedPeriodUs, overrun, notifyTimeout);
    if (!usePeriodicWakeTimer) {
      vTaskDelay(period);
    }
  }
}

void taskPiCommsTx(void* parameter) {
  PiCommsConfig* cfg = static_cast<PiCommsConfig*>(parameter);
  if (cfg == nullptr) {
    broadcastIf(true, "[PI][TX] Configuracion invalida, abortando tarea");
    vTaskDelete(nullptr);
    return;
  }

  const TickType_t period = (cfg->txTaskPeriod > 0) ? cfg->txTaskPeriod : pdMS_TO_TICKS(10);
  const uint32_t expectedPeriodUs = static_cast<uint32_t>(period * portTICK_PERIOD_MS * 1000U);
  TickType_t lastWake = xTaskGetTickCount();
  TickType_t lastBatteryFrameTick = 0;
  uint32_t telemetryTxSequence = 0;
  int64_t lastIterationStartUs = esp_timer_get_time();

  while (true) {
    const int64_t iterationStartUs = esp_timer_get_time();
    uint32_t cycleUs = 0;
    if (iterationStartUs > lastIterationStartUs) {
      cycleUs = static_cast<uint32_t>(iterationStartUs - lastIterationStartUs);
    }
    lastIterationStartUs = iterationStartUs;
    if (g_initialized) {
      const uint8_t status = encodeStatusFlags();
      HallSpeedSnapshot hallSnapshot{};
      const bool hallSnapshotOk = hallSpeedGetSnapshot(hallSnapshot);
      const uint16_t speedTelemetry = encodeSpeedTelemetryFromHall(hallSnapshot, hallSnapshotOk);
      const int16_t steerTelemetry = encodeSteerTelemetryCentered();
      const uint8_t brakePercent = encodeAppliedBrakePercent();

      uint8_t frame[kTxFrameSize];
      frame[0] = kHeaderTx;
      frame[1] = status;
      frame[2] = static_cast<uint8_t>(speedTelemetry & 0xFFu);
      frame[3] = static_cast<uint8_t>((speedTelemetry >> 8) & 0xFFu);
      const uint16_t steerBits = static_cast<uint16_t>(steerTelemetry);
      frame[4] = static_cast<uint8_t>(steerBits & 0xFFu);
      frame[5] = static_cast<uint8_t>((steerBits >> 8) & 0xFFu);
      frame[6] = brakePercent;
      frame[7] = crc8_maxim(frame, kTxFrameSize - 1);

      uart_write_bytes(cfg->uartNum, reinterpret_cast<const char*>(frame), sizeof(frame));
      const TickType_t nowTick = xTaskGetTickCount();
      const uint32_t txTimestampUs = micros();
      telemetryTxSequence++;
      logHallTelemetryTrace(
          hallSnapshot, hallSnapshotOk, telemetryTxSequence, txTimestampUs, speedTelemetry);
      logTxFrame(*cfg, status, speedTelemetry, steerTelemetry, brakePercent, nowTick);

      const TickType_t batteryPeriod =
          (cfg->batteryTxPeriod > 0) ? cfg->batteryTxPeriod : pdMS_TO_TICKS(1000);
      const bool sendBatteryFrame =
          (lastBatteryFrameTick == 0) || ((nowTick - lastBatteryFrameTick) >= batteryPeriod);

      if (sendBatteryFrame) {
        BatterySnapshot batterySnapshot{};
        batteryMonitorGetSnapshot(batterySnapshot);

        const uint8_t batteryFlags =
            encodeBatteryFlags(batterySnapshot, nowTick, pdMS_TO_TICKS(5000));
        const uint16_t batteryCentiVolts =
            clampToU16((batterySnapshot.batteryMv + 5u) / 10u);
        const uint16_t adcPinMv = clampToU16(batterySnapshot.adcPinMv);
        const uint8_t sampleAgeDs = encodeBatterySampleAgeDs(batterySnapshot, nowTick);

        uint8_t batteryFrame[kBatteryTxFrameSize];
        batteryFrame[0] = kHeaderBatteryTx;
        batteryFrame[1] = batteryFlags;
        batteryFrame[2] = static_cast<uint8_t>(batteryCentiVolts & 0xFFu);
        batteryFrame[3] = static_cast<uint8_t>((batteryCentiVolts >> 8) & 0xFFu);
        batteryFrame[4] = static_cast<uint8_t>(adcPinMv & 0xFFu);
        batteryFrame[5] = static_cast<uint8_t>((adcPinMv >> 8) & 0xFFu);
        batteryFrame[6] = sampleAgeDs;
        batteryFrame[7] = crc8_maxim(batteryFrame, kBatteryTxFrameSize - 1);

        uart_write_bytes(
            cfg->uartNum,
            reinterpret_cast<const char*>(batteryFrame),
            sizeof(batteryFrame));

        portENTER_CRITICAL(&g_stateMux);
        g_batteryTxState.hasFrame = true;
        g_batteryTxState.lastFrameTick = nowTick;
        g_batteryTxState.flags = batteryFlags;
        g_batteryTxState.batteryCentiVolts = batteryCentiVolts;
        g_batteryTxState.adcPinMv = adcPinMv;
        g_batteryTxState.sampleAgeDs = sampleAgeDs;
        g_batteryTxState.framesSent += 1;
        portEXIT_CRITICAL(&g_stateMux);

        logBatteryTxFrame(*cfg, batteryFlags, batteryCentiVolts, adcPinMv, sampleAgeDs, nowTick);
        lastBatteryFrameTick = nowTick;
      }
    }

    const bool overrun = cycleUs > expectedPeriodUs;
    systemDiagReportLoop(SystemDiagTaskId::kPiUartTx, cycleUs, expectedPeriodUs, overrun, false);
    vTaskDelayUntil(&lastWake, period);
  }
}
